# Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр. Учтите, что числа могут быть отрицательными
# Пример:
# 67.82 -> 23
# (-0.56) -> 11


number_user = float(input('Введите число: '))
# try:
#     number_user = float(number_user)
#     print(range(number_user))
# except ValueError:
#     print('Вы ввели не число\n')

list_number_user = [number_user]
print(list_number_user)




